Repository: stroeradu1994/Commuting-App-Mobile-Public
Catalog: lib/l10n/app_*.arb
Languages: ro

# welcomeScreenTitle
source: Welcome to Commuting
ro: Commuting - Bine ai venit

# welcomeScreenSubtitle
source: Drive other people on your common routes, or enjoy the confort of riding with other users easy and cheap
ro: Imparte traseul tau cu alte persoane sau bucura-te de confortul calatoriei cu masina, simplu si ieftin

# welcomeScreenStart
source: Get Started
ro: Porneste

source: Log in
ro: Intra in cont

# accountNewAccount
source: Create New Account
ro: Creaza un cont nou

# continueText
source: Continue
ro: Continua

# emailInputTitle
source: Enter Email
ro: Introdu Adresa Email

# emailInputInfo
source: A verification email will be sent to you
ro: Vei primi un email de verificare catre adresa introdusa

# emailInputError
source: Email not valid
ro: Adresa de email nu este valida

# emailVerificationTitle
source: Verify Email
ro: Verifica adresa de email

# emailVerificationInfo
source: An email has been sent to
ro: Un email a fost trimis la

# emailVerificationNoCode
source: Didn't receive the code?
ro: Nu ai primit codul?

# emailVerificationResend
source: Resend
ro: Retrimite

# emailVerificationError
source: Pin is not valid
ro: Pin-ul nu este vlaid

# nameInputTitle
source: First and Last Name
ro: Nume si Prenume

# nameInputInfo
source: Please provide your first and last name
ro: Introdu numele si prenumele tau

# nameFirstInputLabel
source: First Name
ro: Prenume

# nameLastInputLabel
source: Last Name
ro: Nume

# nameFirstInputError
source: First Name is not valid
ro: Prenumele nu este valid

# nameLastInputError
source: Last Name is not valid
ro: Numele nu este valid

# phoneInputTitle
source: Enter Phone Number
ro: Introdu numarul de telefon

# phoneInputInfo
source: A verification SMS will be sent to you
ro: Un SMS de verificare va trimis catre telefonul introdus

# phoneInputVerify
source: Verify Phone
ro: Verifica numarul

# phoneInputError
source: Phone not valid
ro: Numarul de telefon nu este valid

# phoneVerificationTitle
source: Verify Phone
ro: Verifica numarul de telefon

# phoneVerificationInfo
source: An phone has been sent to
ro: Un SMS de verificare a fost trimis catre

# phoneVerificationNoReceive
source: Didn't receive the code?
ro: Nu ai primit codul?

# phoneVerificationResend
source: Resend
ro: Retrimite

# phoneVerificationAction
source: Verify Phone
ro: Verifica telefonul

# phoneVerificationError
source: Pin is not valid
ro: Pinul nu este valid

# tripsActiveTrip
source: Active Trip
ro: Curse Active

# tripstripRequests
source: Trip Requests
ro: Cereri de cursa

# tripsUpcomingTrips
source: Upcoming Trips
ro: Curse Viitoare

# tripsCreateTrip
source: Create New Trip
ro: Creaza cursă / cerere

# tripsMatchesFound
source: matches found
ro: parteneri gasiti

# tripsChooseOne
source: Choose one and share the ride
ro: Alege o cursa

# tripsPassnegersJoin
source: passengers will join your ride
ro: pasageri ti se alatura

# tripsStartTrip
source: Start the trip
ro: Incepe cursa

# tripsConfirmTrip
source: Confirm the trip
ro: Confirma cursa

# tripsTripConfirmed
source: Trip confirmed
ro: Cursa confirmata

# tripsTripNotConfirmed
source: Trip not yet confirmed
ro: Cursa nu a fost confirmata

source: Leave at
ro: Plecare la

# tripsWaitingForConfirmation
source: Waiting for trip confirmation
ro: Asteptare pentru confirmarea cursei

# tripsPickup
source: Pick up
ro: Preluare

# tripsDrop
source: Drop
ro: Separare

# tripsNextForPickup
source: Driver is picking you up next
ro: Soferul te va prelua in curand

# tripsNextForDrop
source: Driving is dropping you next
ro: Soferul te va lasa in curand

# newTripTitle
source: New Trip
ro: Cursă / cerere noua

# newTripCreate
source: Create
ro: Crează

# newTripType
source: Trip Type
ro: Tipul

source: Driver
ro: Șofer

# driverInfo
source: You will drive
ro: Alege ruta pe o preferi, preia si lasa pasageri in timpul cursei

source: Passenger
ro: Pasager

# passengerInfo
source: You will be a passenger
ro: Alege o cursa care ti se potriveste, intalneste-te cu soferul la punctul cel mai apropiat de tine

source: Choose Car
ro: Alege mașina

source: Add New Car
ro: Adaugă mașina

source: Choose Time
ro: Alege timpul

source: Leave Location
ro: Locația de plecare

source: Arrive Location
ro: Locația de sosire

source: Add Location
ro: Adaugă Locație

source: Choose Time to Arrive
ro: Alege timpul de sosire

source: Choose Time to Leave
ro: Alege timpul de plecare

# asap
source: As soon as possible
ro: Cât mai curand

source: Arrive by
ro: Sosire pana la

source: Choose Route
ro: Alege ruta

source: No Route Found
ro: Nicio ruta gasita

source: Distance
ro: Distanta

source: Duration
ro: Durata

source: No Route Selected
ro: Nici o ruta aleasa

source: Route Selected
ro: Ruta aleasa

source: Logout
ro: Iesire din cont

source: Notifications
ro: Notificari

source: History
ro: Istoric

source: Past Trips
ro: Curse Trecute

# tripExpired
source: Expired Trip
ro: Cursa expirata

# tripCancelledByDriver
source: Trip Canceled by Driver
ro: Cursa anulata de sofer

# tripDismissed
source: Trip Dismissed for no passengers
ro: Cursa anulata datorita lipsei de pasageri

source: Current Trip
ro: Cursa Activa

source: Driving
ro: Sofer

source: Arrive
ro: Sosire

source: Passengers
ro: Pasageri

source: View Map
ro: Vezi harta

source: Open
ro: Deschide

source: Confirm Pickup
ro: Cofirma preluare pasager

# tripsCompleted
source: Trip completed
ro: Cursa Finalizata

# arrivedAtPickup
source: Arrived at pickup location
ro: Anunta sosire loc de intalnire

source: Confirm Drop
ro: Confirma separare de pasager

source: Leave from
ro: Plecare de la

# driverArrivedAtPickup
source: Driver arrived at pickup location
ro: Soferul a ajuns la locul de intalnire

# getPickedUp
source: Get picked up by
ro: Intalnire cu

# getDropped
source: Get dropped by
ro: Separare de

source: Arrive at
ro: Sosire la

source: Walking
ro: Mers pe jos

source: Trip
ro: Cursa

source: Map
ro: Harta

source: Choose Trip
ro: Alege cursa

source: Leaving
ro: Plecare

source: Arriving
ro: Sosire

source: Trip Map
ro: Harta Cursei

source: Past Trip
ro: Cursa trecuta

source: matches found.
ro: parteneri gasiti.

source: Upcoming Trip
ro: Cursa viitoare

# passengerLowCase
source: passengers
ro: pasageri

source: Confirm Trip
ro: Confirma cursa

source: Start Trip
ro: Incepe cursa

source: Complete Trip
ro: Finalizeaza cursa

source: Choose other trip
ro: Alege alta cursa

source: Rating
ro: Evaluare

# tripNotYetConfirmed
source: Trip is not yet confirmed
ro: Cursa nu a fost inca confirmata

# meetWithDriver
source: Meet with your driver at the pickup point
ro: Intalneste-te cu soferul la punctul de intalnire

source: From
ro: De la

source: To
ro: La

source: Trips
ro: Curse

source: Vouchers
ro: Cupoane

source: Statistics
ro: Statistici

source: Profile
ro: Profil

source: Support
ro: Suport

source: About
ro: Despre aplicatie

source: Good morning
ro: Buna dimineata

source: points
ro: puncte

# pointsCaps
source: Points
ro: Puncte

# enterCarBrand
source: Enter your Car Brand and Model
ro: Marca si Modelul masinii

# enterCarBrandInfo
source: Please provider your car brand and model
ro: Introdu marca si modelul masinii

# enterCarColor
source: Enter your Car Color
ro: Culoarea masinii

# enterCarColorInfo
source: Please provide your car color
ro: Introdu culoarea masinii

# enterCarPlate
source: Enter your Car Plate Number
ro: Numarul de inmnatriculare

# enterCarPlateInfo
source: Please provide your car plate number
ro: Introdu numarul de inmatriculare a masinii

source: White
ro: Alb

source: Black
ro: Negru

source: Blue
ro: Albastru

source: Gray
ro: Gri

source: Yellow
ro: Galben

source: Green
ro: Verde

source: New Location
ro: Locatie noua

source: Home
ro: Acasa

source: Work
ro: Serviciu

source: School
ro: Scoala

source: College
ro: Facultate

source: Add
ro: Adauga

source: Add Label
ro: Adauga Eticheta

source: Create Location
ro: Adauga Locatie

source: Cancel Trip
ro: Anulare cursa

source: Leave
ro: Plecare

# confirmTripInfo
source: Once a trip is confirmed, you are responsible to pick up all the passengers that choose to ride with you
ro: Odata ce cursa a fost confirmata, sunteti responsabili cu preluarea tuturor pasagerilor ce au optat sa calatoreasca cu dumneavoastra

# announcePassengersInfo
source: Don't forget to announce when you leave, so that the passengers can prepare to meet you
ro: Nu uitati sa anuntati plecarea, astfel incat pasagerii sa poata ajunge la punctul de intalnire

source: Number of Trips as Driver
ro: Numarul de curse ca sofer

source: Number of Trips as Passenger
ro: Numarul de curse ca pasager

# kmAsDriver
source: Distance Traveled as a Driver
ro: Distanta parcursa ca sofer

# kmAsPassenger
source: Distance Traveled as a Passenger
ro: Distanta parcursa ca pasager

source: Number of Passengers
ro: Numarul de pasageri

# noVouchers
source: No Vouchers are currently available for purchase
ro: Niciun cupon nu este disponibil momentan

source: Locations
ro: Locatii

# cars
source: Personal Cars
ro: Masini personale
